import React from "react";
import styles from './about-page.module.scss';
import Fade from 'react-reveal/Fade';
import Image from './image';
import sizeMe from 'react-sizeme';


const AboutPage = (props) => {
  const { width } = props.size;

  let deviceSmall = false
  if (500 > width) {
    deviceSmall = true
  } 

    return <div className={deviceSmall ? styles.about_small : styles.about} itemScope itemType='https://schema.org/AboutPage'>
        <Fade left duration={3000}>
          <div itemScope itemType='https://schema.org/Brand' className={deviceSmall ? styles.content_small : styles.content}>
            {deviceSmall ? null : <Image imgName='office.jpg' alt='משרד זיתוני' className={styles.office} />}
            <div className={styles.text_container}>
              <div className={styles.text}>
                <h1 itemProp='name'>קבוצת זיתוני</h1>
                <span itemProp='description'>
                <p>קבוצת זיתוני הינה קבוצת חברות בנייה המתמחה בייזום, בתכנון, בבנייה ובשיווק למגורים באזור השרון ובגוש דן. הקבוצה נוסדה בשנת 1987, ופועלת בשיתוף פעולה עם חברת משה ויגאל גינדי. הקבוצה מנוהלות על ידי אבי זיתוני, חבר הנהלת ארגון הקבלנים והבונים בתל-אביב יפו, דור שני למשפחת קבלנים ובעל ניסיון רב בתחום הבנייה למגורים.</p>
                <p>החזון מאחורי פעילות הקבוצה הוא להגשים חלומות עבור זוגות צעירים ומשפרי דיור שחולמים על בית חדש, מודרני ומעוצב באזור יפה ומבוקש. קבוצת זיתוני מתמקדת בבנייה למגורים לקהל ברמה סוציו-אקונומית בינונית עד גבוהה. לשם כך, הקבוצה יוזמת איתור ורכישה של קרקעות באזורים חדשים ומתפתחים, ומטביעה בהם את חותמה בעזרת תכנון מיוחד, מודרני וחדשני ובנייה ענפה ומתקדמת. רמת הבנייה ורמת המפרט הטכני של הדירות הינן גבוהות ביותר, ובכל פרויקט חדש, הרמה וטיב הבנייה עולים ומשודרגים. החזון הזה מודגם היטב בפרויקטים שבונה הקבוצה בהרצליה, בפתח תקווה, בגבעת שמואל, בכפר סבא ובהוד השרון, הנחשבות לאזור מבוקש בקרב קהל רוכשי הדירות.
                </p>
                <p>אנו, בקבוצת זיתוני, הצבנו לעצמנו מטרה להעניק ללקוחותינו שירות ברמה המקצועית הגבוהה ביותר, לצד יחס אישי חם ואדיב. כחלק מתפיסת העולם של החברה, כל פרויקט מלווה באופן אישי על ידי עובדי החברה, מתחילת תהליך הרכישה ועד לרגע הכניסה לדירה החדשה. 
                </p>
                <h1>בנייה ירוקה</h1>
                <p>בנייה ירוקה הינה תפיסת חיים ומגורים בסביבה מתקדמת, ירוקה וידידותית לסביבה ולתושביה, המעניקה את המיטב לצרכיי המשפחה ולעתיד ילדיה, וזאת על פי עקרונות הבנייה הירוקה לשיפור איכות החיים והסביבה.תפיסת אקו קונספט הולידה את אקו כפר סבא הירוקה - מתחם מגורים ייחודי בלב שכונה ירוקה ראשונה מסוגה בישראל, המתבססת על אמנה חברתית ומוגדרת על פי האוגדן הירוק של עיריית כפר סבא. 
                </p>
                <p>בנייה ירוקה היא גישה רב-מערכתית לתכנון, בנייה ותפעול של בתים במטרה לייצר חסכון באנרגיה, מים וחומרי גלם. עקרונות התפיסה הירוקה מיושמים משלב התכנון ועד לשימוש היומיומי בבית. הזיהום הרב, הפגיעה בכדור הארץ וכמובן העלויות הניכרות של מחצבים המשמשים לאנרגיה (נפט ופחם), הם המניעים העיקריים המובילים לקידום בנייה ירוקה כמגמה עולמית.השאיפה לחיסכון באנרגיה באה לידי ביטוי בבנייה ירוקה באמצעות שימוש בחומרים אקולוגים הידידותיים לסביבה, בידוד איכותי ומעטפת איטום החוצצים בין האקלים החיצוני לבין אקלים הפנימי בבית ומאפשרים לשמור בבית על טמפרטורה נוחה לאורך כל עונות השנה, ללא צורך בשימוש מסיבי של אמצעי מיזוג שונים.</p>
                <p>חלק בלתי נפרד מהבנייה הירוקה מתייחס לסביבת המגורים החל מגינות, שבילי אופניים והגליית רכבים אל מחוץ לשכונה, ועד מערכות מחזור מים, מערך סילוק אשפה, חיבורי גז ואשפה למערכות שכונתיות, רשת מחשבים וטלקומוניקציה מקומית ועוד. 
                </p>
                </span>
              </div>
            </div>
          </div>
        </Fade>
    </div>
};

export default sizeMe({ monitorWidth: true })(AboutPage)