import React from "react";
import styles from './accessibility-content.module.scss';


const AccessibilityContent = () => {
  return <div className={styles.accessibility}>
      <h1>הצהרת נגישות</h1>
      <p>
      האינטרנט מהווה כיום את המאגר הגדול ביותר לחופש המידע עבור כלל המשתמשים ומשתמשים בעלי מוגבלויות בפרט. ככזה, אנו שמים חשיבות רבה במתן אפשרות שווה לאנשים עם מוגבלות לשימוש במידע המוצג באתר ולאפשר חווית גלישה טובה יותר.
      אנו שואפים להבטיח כי השירותים הדיגיטליים יהיו נגישים לאנשים עם מוגבלויות ועל כן הושקעו משאבים רבים להקל את השימוש באתר עבור אנשים עם מוגבלויות, ככל האפשר, מתוך אמונה כי לכל אדם מגיעה הזכות לחיות בשוויון, כבוד, נוחות ועצמאות.
      </p>
      <p>התאמות הנגישות באתר שלנו בוצעו בהתאם לתקנה 35 בתקנות שוויון זכויות לאנשים עם מוגבלות (התאמות נגישות לשירות) התשע"ג 2013 ,לתקן הישראלי ת"י 5568 המבוסס על הנחיות 2.0WCAG לרמה AA ובכפוף לשינויים והתאמות שבוצעו במסמך התקן הישראלי.
      התאמת הנגישות נבדקה בדפדפנים המובילים כגון פיירפוקס וכרום בגירסאות האחרונות, וכלה בשימוש טכנולוגיות מסייעות מסוג קורא מסך (NVDA).</p>
      <h1>כיצד הונגש האתר</h1>
      <ul>
        <li>תיאור טקסטואלי לתמונות ואייקונים עבור טכנולוגיות מסייעות.</li>
        <li>הוטמעו חוקי ARIA העוזרים לפרש את תוכן האתר בצורה מדויקת וטובה יותר.</li>
        <li>הנגשת תפריטים, טפסים, היררכיית כותרות, רכיב טאבים, חלונות קופצים ועוד.</li>
        <li>כדי לנווט באתר בעזרת המקלדת השתמשו בכפתור ה-Tab.</li>
        <li>כל לחיצה עליו תעביר אותכם ללינק הבא. לחיצה על Shift + Tab תחזיר אותכם ללינק הקודם.</li>
        <li>שינוי גודל הגופן מתבצע באמצעות המקלדת, עבור הגדלת הגופן יש ללחוץ על המקשים ctrl +,
        עבור הקטנת הגופן יש ללחוץ על המקשים ctrl –.</li>
      </ul>
      <h1>הבהרה</h1>
      <p>חרף מאמצנו לאפשר גלישה באתר נגיש עבור כל דפי האתר, יתכן ויתגלו דפים באתר שטרם הונגשו, או שטרם נמצא הפתרון הטכנולוגי המתאים . אנו ממשיכים במאמצים לשפר את נגישות האתר, ככל האפשר, וזאת מתוך אמונה ומחויבות מוסרית לאפשר שימוש באתר לכלל האוכלוסייה לרבות אנשים עם מוגבלויות.</p>
      <h1>הסדרי נגישות בחברה</h1>
      <ul>
      <li>מעלית במשרד הראשי של החברה הנמצא בכפר סבא</li>
      <li>משרדי מכירות מונגשים לנכים (רמפה)</li>
      </ul>
      <h1>פרטי רכזת נגישות בחברה</h1>
      <p>ספיר זיתוני- מנהלת פיתוח עסקי</p>
      <p>נייד: 054-6330900</p>
      <p>מייל: sapir@zeitouni-ltd.co.il</p>
      <p></p>
      <p><strong>ההצהרה עודכנה לאחרונה בתאריך 1.4.2020</strong></p>
  </div>
};

export default AccessibilityContent