import React from 'react';
import Flickity from 'react-flickity-component'
import "./flickity.css";
import CarouselSlide from './carousel-slide';


const flickityOptions = {
  initialIndex: 3,
  wrapAround: true,
  autoPlay: 3000,
  selectedAttraction: 0.01,
  friction: 0.15,
  freeScroll: true,
  freeScrollFriction: 0.03
}


const Carousel = () => {
  return (
    <Flickity
      className={'carousel'} // default ''
      elementType={'div'} // default 'div'
      options={flickityOptions} // takes flickity options 
      disableImagesLoaded={false} // default false
      reloadOnUpdate // default false
      static // default false
    >
      <CarouselSlide header="אקו רמת הדר חדשה גבעת שמואל" content=" שכונה המשלבת תכנון ירוק שופע בגינות ופארקים, כיכרות ושבילי אופניים, ואופי קהילתי ואינטימי יחד עם קירבה ונגישות לכל מוקדי העניין של אזור המרכז. רמת הדר החדשה ממוקמת במיקום אופטימלי הסמוך לצירי תנועה מרכזיים (כביש 471, כבישים 4 ו-6 וציר ז'בוטינסקי בו נבנית הרכבת הקלה) המעניקה נגישות מקסימלית לכל אזורי ההייטק ומרכזי התעסוקה במרכז ובשרון. כמו כן, השכונה מאפשרת ליהנות מכל מה שחשוב למשפחה בקרבת מקום- פארק רמון רחב הידיים, קניון הגבעה, הולמס פלייס גבעת שמואל, מוסדות רפואיים ואקדמאים וכו'. למעשה הפרויקט אקו רמת הדר החדשה נמצא במיקום הטוב ביותר בחלק הצפון מערבי של השכונה, על קו הגבול בין רמת הדר מצד אחד, ואוניברסיטת בר אילן מצידה השני. ממערב ניתן ליהנות מנוף פתוח עד קו האופק כמותו לא נראה באף פרויקט אחר בשכונה. הפרויקט יכלול 2 מגדלים בני 21 קומות עם תמהיל מגוון הכולל דירות רחבות ידיים בנות 3, 4, 5 ו-6 חדרים. כל דירה בעלת מרפסת שמש גדולה, גימור בסטנדרט הגבוה ביותר, מפרט עשיר ומפנק ותכנון המאפשר גמישות רבה בעיצוב החלל והתאמתו לצרכים הייחודיים של כל משפחה. בנוסף, הפרויקט מציע 6 פנטהאוזים מרהיבים שתוכננו תחת הקונספט 'השמיים הם הגבול'- בראש כל אחד מהמגדלים, ניצב פנטהאוז אחד ויחיד בקומה, מוקף רק בשמיים." />
      <CarouselSlide header="אקו רמת הדר חדשה גבעת שמואל" content=" שכונה המשלבת תכנון ירוק שופע בגינות ופארקים, כיכרות ושבילי אופניים, ואופי קהילתי ואינטימי יחד עם קירבה ונגישות לכל מוקדי העניין של אזור המרכז. רמת הדר החדשה ממוקמת במיקום אופטימלי הסמוך לצירי תנועה מרכזיים (כביש 471, כבישים 4 ו-6 וציר ז'בוטינסקי בו נבנית הרכבת הקלה) המעניקה נגישות מקסימלית לכל אזורי ההייטק ומרכזי התעסוקה במרכז ובשרון. כמו כן, השכונה מאפשרת ליהנות מכל מה שחשוב למשפחה בקרבת מקום- פארק רמון רחב הידיים, קניון הגבעה, הולמס פלייס גבעת שמואל, מוסדות רפואיים ואקדמאים וכו'. למעשה הפרויקט אקו רמת הדר החדשה נמצא במיקום הטוב ביותר בחלק הצפון מערבי של השכונה, על קו הגבול בין רמת הדר מצד אחד, ואוניברסיטת בר אילן מצידה השני. ממערב ניתן ליהנות מנוף פתוח עד קו האופק כמותו לא נראה באף פרויקט אחר בשכונה. הפרויקט יכלול 2 מגדלים בני 21 קומות עם תמהיל מגוון הכולל דירות רחבות ידיים בנות 3, 4, 5 ו-6 חדרים. כל דירה בעלת מרפסת שמש גדולה, גימור בסטנדרט הגבוה ביותר, מפרט עשיר ומפנק ותכנון המאפשר גמישות רבה בעיצוב החלל והתאמתו לצרכים הייחודיים של כל משפחה. בנוסף, הפרויקט מציע 6 פנטהאוזים מרהיבים שתוכננו תחת הקונספט 'השמיים הם הגבול'- בראש כל אחד מהמגדלים, ניצב פנטהאוז אחד ויחיד בקומה, מוקף רק בשמיים." />
      <CarouselSlide header="אקו רמת הדר חדשה גבעת שמואל" content=" שכונה המשלבת תכנון ירוק שופע בגינות ופארקים, כיכרות ושבילי אופניים, ואופי קהילתי ואינטימי יחד עם קירבה ונגישות לכל מוקדי העניין של אזור המרכז. רמת הדר החדשה ממוקמת במיקום אופטימלי הסמוך לצירי תנועה מרכזיים (כביש 471, כבישים 4 ו-6 וציר ז'בוטינסקי בו נבנית הרכבת הקלה) המעניקה נגישות מקסימלית לכל אזורי ההייטק ומרכזי התעסוקה במרכז ובשרון. כמו כן, השכונה מאפשרת ליהנות מכל מה שחשוב למשפחה בקרבת מקום- פארק רמון רחב הידיים, קניון הגבעה, הולמס פלייס גבעת שמואל, מוסדות רפואיים ואקדמאים וכו'. למעשה הפרויקט אקו רמת הדר החדשה נמצא במיקום הטוב ביותר בחלק הצפון מערבי של השכונה, על קו הגבול בין רמת הדר מצד אחד, ואוניברסיטת בר אילן מצידה השני. ממערב ניתן ליהנות מנוף פתוח עד קו האופק כמותו לא נראה באף פרויקט אחר בשכונה. הפרויקט יכלול 2 מגדלים בני 21 קומות עם תמהיל מגוון הכולל דירות רחבות ידיים בנות 3, 4, 5 ו-6 חדרים. כל דירה בעלת מרפסת שמש גדולה, גימור בסטנדרט הגבוה ביותר, מפרט עשיר ומפנק ותכנון המאפשר גמישות רבה בעיצוב החלל והתאמתו לצרכים הייחודיים של כל משפחה. בנוסף, הפרויקט מציע 6 פנטהאוזים מרהיבים שתוכננו תחת הקונספט 'השמיים הם הגבול'- בראש כל אחד מהמגדלים, ניצב פנטהאוז אחד ויחיד בקומה, מוקף רק בשמיים." />
      <CarouselSlide header="אקו רמת הדר חדשה גבעת שמואל" content=" שכונה המשלבת תכנון ירוק שופע בגינות ופארקים, כיכרות ושבילי אופניים, ואופי קהילתי ואינטימי יחד עם קירבה ונגישות לכל מוקדי העניין של אזור המרכז. רמת הדר החדשה ממוקמת במיקום אופטימלי הסמוך לצירי תנועה מרכזיים (כביש 471, כבישים 4 ו-6 וציר ז'בוטינסקי בו נבנית הרכבת הקלה) המעניקה נגישות מקסימלית לכל אזורי ההייטק ומרכזי התעסוקה במרכז ובשרון. כמו כן, השכונה מאפשרת ליהנות מכל מה שחשוב למשפחה בקרבת מקום- פארק רמון רחב הידיים, קניון הגבעה, הולמס פלייס גבעת שמואל, מוסדות רפואיים ואקדמאים וכו'. למעשה הפרויקט אקו רמת הדר החדשה נמצא במיקום הטוב ביותר בחלק הצפון מערבי של השכונה, על קו הגבול בין רמת הדר מצד אחד, ואוניברסיטת בר אילן מצידה השני. ממערב ניתן ליהנות מנוף פתוח עד קו האופק כמותו לא נראה באף פרויקט אחר בשכונה. הפרויקט יכלול 2 מגדלים בני 21 קומות עם תמהיל מגוון הכולל דירות רחבות ידיים בנות 3, 4, 5 ו-6 חדרים. כל דירה בעלת מרפסת שמש גדולה, גימור בסטנדרט הגבוה ביותר, מפרט עשיר ומפנק ותכנון המאפשר גמישות רבה בעיצוב החלל והתאמתו לצרכים הייחודיים של כל משפחה. בנוסף, הפרויקט מציע 6 פנטהאוזים מרהיבים שתוכננו תחת הקונספט 'השמיים הם הגבול'- בראש כל אחד מהמגדלים, ניצב פנטהאוז אחד ויחיד בקומה, מוקף רק בשמיים." />
      <CarouselSlide header="אקו רמת הדר חדשה גבעת שמואל" content=" שכונה המשלבת תכנון ירוק שופע בגינות ופארקים, כיכרות ושבילי אופניים, ואופי קהילתי ואינטימי יחד עם קירבה ונגישות לכל מוקדי העניין של אזור המרכז. רמת הדר החדשה ממוקמת במיקום אופטימלי הסמוך לצירי תנועה מרכזיים (כביש 471, כבישים 4 ו-6 וציר ז'בוטינסקי בו נבנית הרכבת הקלה) המעניקה נגישות מקסימלית לכל אזורי ההייטק ומרכזי התעסוקה במרכז ובשרון. כמו כן, השכונה מאפשרת ליהנות מכל מה שחשוב למשפחה בקרבת מקום- פארק רמון רחב הידיים, קניון הגבעה, הולמס פלייס גבעת שמואל, מוסדות רפואיים ואקדמאים וכו'. למעשה הפרויקט אקו רמת הדר החדשה נמצא במיקום הטוב ביותר בחלק הצפון מערבי של השכונה, על קו הגבול בין רמת הדר מצד אחד, ואוניברסיטת בר אילן מצידה השני. ממערב ניתן ליהנות מנוף פתוח עד קו האופק כמותו לא נראה באף פרויקט אחר בשכונה. הפרויקט יכלול 2 מגדלים בני 21 קומות עם תמהיל מגוון הכולל דירות רחבות ידיים בנות 3, 4, 5 ו-6 חדרים. כל דירה בעלת מרפסת שמש גדולה, גימור בסטנדרט הגבוה ביותר, מפרט עשיר ומפנק ותכנון המאפשר גמישות רבה בעיצוב החלל והתאמתו לצרכים הייחודיים של כל משפחה. בנוסף, הפרויקט מציע 6 פנטהאוזים מרהיבים שתוכננו תחת הקונספט 'השמיים הם הגבול'- בראש כל אחד מהמגדלים, ניצב פנטהאוז אחד ויחיד בקומה, מוקף רק בשמיים." />
      
    </Flickity>
  )
}

export default Carousel